---
title: ExportIFCCategoryKey
classe: Autodesk.Revit.DB.ExportIFCCategoryKey
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ExportIFCCategoryKey

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CategoryName { get; set; }` | `exportIFCCategoryKey.CategoryName` | String |
| `CustomSubCategoryId CustomSubCategoryId { get; set; }` | `exportIFCCategoryKey.CustomSubCategoryId` | CustomSubCategoryId |
| `Boolean IsValidObject { get; }` | `exportIFCCategoryKey.IsValidObject` | Boolean |
| `String SubCategoryName { get; set; }` | `exportIFCCategoryKey.SubCategoryName` | String |
| `Void Dispose()` | `exportIFCCategoryKey.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```